# Задача2.	Даны два кортежа: C_1 = (35, 78,21,37, 2,98, 6, 100, 231)
#C_2 = (45, 21,124,76,5,23,91,234)
#Необходимо определить:
#1) Сумма элементов какого из кортежей больше и вывести соответствующее сообщение на экран (Сумма больше в кортеже - ..)
#2) Вывести на экран порядковые номера минимальных и максимальных элементов этих кортежей.

C_1 = (35, 78,21,37, 2,98, 6, 100, 231)
C_2 = (45, 21,124,76,5,23,91,234)
if  C_1>C_2:
    print('Сумма больше в кортеже c_1')
else:
   print('Сумма больше в кортеже C_2')
print ('max', max(C_1), 'min', min(C_1))
print('max', max(C_2), 'min', min(C_2))